IRP/src/Documents/PriceList/PriceList.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PriceList</name>
  <registerRecords>InformationRegister.PricesByItemKeys</registerRecords>
  <registerRecords>InformationRegister.PricesByItems</registerRecords>
  <registerRecords>InformationRegister.PricesByProperties</registerRecords>
  <attributes>
    <name>PriceType</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemType</name>
    <type>
      <types>CatalogRef.ItemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceListType</name>
    <type>
      <types>EnumRef.PriceListTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>DefinedType.typeItem</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ItemKeyList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typePrice</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DataSet</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DataPrice</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>DefinedType.typeItem</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Enums/PriceListTypes/PriceListTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PriceListTypes</name>
  <enumValues>
    <name>PriceByItems</name>
  </enumValues>
  <enumValues>
    <name>PriceByItemKeys</name>
  </enumValues>
  <enumValues>
    <name>PriceByProperties</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Documents/PriceList/ObjectModule.bsl
Procedure Posting(Cancel, PostingMode)
	PostingServer.Post(ThisObject, Cancel, PostingMode, ThisObject.AdditionalProperties);
EndProcedure

Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	If ThisObject.PriceListType <> Enums.PriceListTypes.PriceByItemKeys Then
		ThisObject.ItemKeyList.Clear();
	EndIf;
	
	If ThisObject.PriceListType <> Enums.PriceListTypes.PriceByItems Then
		ThisObject.ItemList.Clear();
	EndIf;
	
	If ThisObject.PriceListType <> Enums.PriceListTypes.PriceByProperties Then
		ThisObject.DataSet.Clear();
		ThisObject.DataPrice.Clear();
	EndIf;
EndProcedure

Procedure UndoPosting(Cancel)
	UndopostingServer.Undopost(ThisObject, Cancel, ThisObject.AdditionalProperties);
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	ThisObject.PriceListType = Enums.PriceListTypes.PriceByItems;
EndProcedure

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	If ThisObject.PriceListType <> Enums.PriceListTypes.PriceByProperties Then
		RemoveCheckedAttribute("ItemType", CheckedAttributes);
	EndIf;
	If ThisObject.PriceListType <> Enums.PriceListTypes.PriceByItemKeys Then
		RemoveCheckedAttribute("ItemKeyList.ItemKey", CheckedAttributes);
	EndIf;
	If ThisObject.PriceListType <> Enums.PriceListTypes.PriceByItems Then
		RemoveCheckedAttribute("ItemList.Item", CheckedAttributes);
	EndIf;
EndProcedure

Procedure RemoveCheckedAttribute(Name, CheckedAttributes)
	Index = CheckedAttributes.Find(Name);
	If Index <> Undefined Then
		CheckedAttributes.Delete(Index);
	EndIf;
EndProcedure
